# Polynomial Regression

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv('ex1data3.txt')
data.head()

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000
2  Senior Consultant      3   60000
3            Manager      4   80000
4    Country Manager      5  110000

In [3]:
data=data.drop(columns='Position')
data.head()

   Level  Salary
0      1   45000
1      2   50000
2      3   60000
3      4   80000
4      5  110000

In [4]:
Y=data.drop(columns='Level')
Y

    Salary
0    45000
1    50000
2    60000
3    80000
4   110000
5   150000
6   200000
7   300000
8   500000
9  1000000

In [5]:
X=data.drop(columns='Salary')
X.head()
X=pd.concat([pd.Series(1, index=X.index, name='00'), X], axis=1)
X['Level1']=X['Level']**2
X['Level1']=X['Level1']/max(X['Level1'])
X['Level2']=X['Level']**3
X['Level2']=X['Level2']/max(X['Level2'])
X

   00  Level  Level1  Level2
0   1      1    0.01   0.001
1   1      2    0.04   0.008
2   1      3    0.09   0.027
3   1      4    0.16   0.064
4   1      5    0.25   0.125
5   1      6    0.36   0.216
6   1      7    0.49   0.343
7   1      8    0.64   0.512
8   1      9    0.81   0.729
9   1     10    1.00   1.000

In [6]:
theta=[0]*(len(X.columns))
theta

[0, 0, 0, 0]

In [7]:
def hypo(theta,X):
    y_pred=theta*X
    y_pred=np.sum(y_pred,axis=1)
    return y_pred

In [8]:
def cost(X,Y,theta):
    n=len(Y)
    y_pred=hypo(theta,X)
    return (0.5/n)*np.sum((y_pred-Y)**2)

In [ ]:
def grad_desc(theta,X,Y,ite,alpha):
    J=[]
    n=len(X)
    for i in range(ite):
        y_pred=hypo(theta,X)
        for j in range(len(theta)):
            theta[j]=theta[j]-(alpha/n)*np.sum((y_pred-Y)*X.iloc[:,j])
        J.append(cost(X,Y,theta))
    return theta,J
theta,J=grad_desc(theta,X,Y,20,0.01)

In [ ]:
plt.scatter(x=X['Level'],y=Y,label="Original")
plt.scatter(x=X['Level'],y=hypo(theta,X),label="Pred")
plt.legend()
plt.show()